export const SITE_NAME = "Админ-панель Тех комф";
export const CLIENT_URL = "http://localhost:5173";

export const pagesData: IPages = {
    home: {
        name: SITE_NAME,
        title: 'Мебель на заказ в Москве – Технологии комфорта',
        description: 'Кухни и корпусная мебель по вашим размерам в Москве и Московской области под ключ за 20 дней',
        keywords: 'мебель на заказ, мебель на заказ москва, мебель по индивидуальному заказу, мебель на заказ по размерам, мебель на заказ по индивидуальным размерам, мебель на заказ недорого, изготовление мебели на заказ, мебель под заказ, мебель на заказ шкафы, мебель по индивидуальному заказу москва, мебель заказ купе, мебель по индивидуальному заказу недорого, мебель на заказ шкаф купе, заказ мебели по размерам недорого, ванна мебель для ванной на заказ, мебель для ванной на заказ, мебель для ванны на заказ, мебель на заказ по размерам москва, мебель на заказ недорого москва, мебель на заказ москва по индивидуальным размерам, мебель на заказ по индивидуальным размерам недорого, корпусная мебель на заказ, корпусную мебель на заказ, мебель по индивидуальному заказу недорого москва, мебель на заказ недорого шкафы, детская мебель на заказ, шкафы купе недорого мебель на заказ, заказ мебели по размерам недорого москва, встраиваемая мебель на заказ, встроенная мебель на заказ, изготовление мебели на заказ москва, изготовление мебели по индивидуальному заказу, фабрика мебели на заказ, производство мебели на заказ, мебель для комнаты на заказ, мебель из массива на заказ, мебель для ванной комнаты на заказ, мебель для ванны комнаты на заказ, мебель из дерева на заказ, изготовление мебели на заказ по индивидуальным размерам, мебель в прихожую на заказ, мебель под заказ москва, мебель для ванной на заказ москва, мебель для ванны на заказ москва, проект мебели на заказ, корпусная мебель на заказ москва, индивидуальный заказ мебели шкаф купе, мебель на заказ от производителя, мебель шкафы на заказ москва, изготовление мебели по индивидуальному заказу москва, мебель под индивидуальный заказ, мебель на заказ отзывы, мебель на заказ по индивидуальным проектам, много мебели заказ, мебель на заказ цены, мебель на заказ шкаф фабрика, мебель на заказ шкафы купе москва, мебель под заказ по индивидуальным размерам, фабрика мебели шкафы купе на заказ, изготовление мебели под заказ, мебель на заказ область, заказать мебель на заказ, купить мебель на заказ, мебель прихожая на заказ москва, изготовление мебели на заказ недорого, дизайнерская мебель на заказ, мебель из массива на заказ москва, мебель на заказ сайт, встроенная мебель заказ недорого, изготавливаю мебель на заказ, изготовить мебель на заказ, мебель для гостиной на заказ, встраиваемая мебель на заказ недорого, мебель для ванны по индивидуальному заказу, мебель под заказ недорого, заказ мебели для ванной по размерам, мебель для ванной под заказ, встраиваемая мебель на заказ москва, встроенная мебель на заказ москва, деревянная мебель на заказ, корпусная мебель на заказ по размерам, корпусная мебель по индивидуальным заказам, мебель на заказ московская область, мебель на заказ фото, встроенная мебель индивидуальному заказу, мебель на заказ из массива дерева, мебель на заказ по проекту москва, мебель на заказ дешево, мебель на заказ по индивидуальным проектам москва, мебель заказ где, стиль мебель заказ, изготовление корпусной мебели на заказ, мебель для ванной комнаты на заказ москва, мебель лофт на заказ, корпусная мебель на заказ по индивидуальным размерам, мебель на заказ премиум, лучшая мебель на заказ, детская мебель на заказ москва, мебель из массива под заказ, детская мебель по индивидуальному заказу, корпусная мебель на заказ недорого, корпусную мебель на заказ недорого, мебель для ванной на заказ по индивидуальным, сделать мебель на заказ, изготовление мебели из массива на заказ, элитная мебель на заказ, договор на мебель на заказ, изготовление мебели на заказ в москве недорого, мебель для спальни на заказ, эксклюзивная мебель на заказ, изготовление мебели из дерева на заказ, корпусная мебель под заказ, мебель под заказ по индивидуальным размерам недорого, мебель заказ индивидуальным проектам недорого, встроенная мебель на заказ по индивидуальным размерам, мебель из лдсп на заказ, производство мебели по индивидуальным заказам, мебель на заказ от производителя москва, фабрика мебели на заказ москва, детская мебель на заказ по размерам, изготовление корпусной мебели на заказ москва, фабрика мебели на заказ по индивидуальным размерам, индивидуальная мебель из дерева на заказ, мебель под заказ цены, гостиная мебель по индивидуальному заказу, мебель заказ встроенный шкаф, мебель на заказ цена шкафы, встраиваемые шкафы мебель на заказ, изготовление мебели из дерева на заказ, изготовление мебели из массива на заказ, изготовить мебель по индивидуальному заказу, изготовить мебель на заказ недорого, красивая мебель на заказ, мебель в прихожую на заказ в москве, мебель для ванной на заказ москва недорого, производство мебели под заказ, заказать мебель под заказ, качественная мебель на заказ, купить мебель на заказ в москве, мебель мастер заказ, мебель на заказ недорого московская, мебель на заказ цвета, заказать мебель по индивидуальным заказам, замер мебели на заказ, мебельная фабрика мебель на заказ, мебель для дома на заказ, встраиваемая мебель на заказ москва недорого, мебель на заказ московская область недорого, продажа мебели на заказ, фабрика корпусной мебели на заказ, заказ мебели гардеробная, мебель на заказ по эскизам заказчика, мебель на заказ фирмы, стильная мебель на заказ, заказ мебели по индивидуальному проекту недорого, мебель на заказ шкафы распашные, мягкая мебель под заказ по индивидуальным, встраиваемая мебель шкафы купе на заказ, мебель заказ официальный сайт, мебель на заказ встроенные шкафы купе, мебель по индивидуальному заказу фото, где заказать мебель на заказ, мебель ванной комнаты индивидуальному заказу, изготовление мебели из лдсп на заказ, изготовление мебели под заказ в москве, лучшая мебель на заказ в москве, мебель из дерева под заказ, мебель на заказ идея, мебель на заказ шкаф купе цена, новая мебель заказ, готовые заказы на мебель, мебель на заказ недорого фото, нестандартная мебель по индивидуальному заказу, мебель из дсп на заказ, мебель из массива дерева на заказ москва, купить мебель под заказ в москве, мебель из дерева на заказ в москве, производители мебели по индивидуальному заказу, мебель на заказ срок, сделать мебель на заказ недорого, изготовление офисной мебели на заказ, мебель на заказ москва фото, нестандартная мебель на заказ по индивидуальным проектам, гостиная мебель на заказ по индивидуальным размерам, мебель под заказ магазинов, мебель заказ услуги, оригинальная мебель на заказ, заказ мебели телефон, эксклюзивная мебель на заказ, дорогая мебель на заказ, мебель под заказ фото',
        type: "website",
        url: CLIENT_URL
    },
}

export const pagesLinks = {
    home: "/",
    questions: '/contacts',
    portfolio: '/portfolio',
    privacyPolicy: '/privacy_policy',
    aboutCompany: '/about'
}

interface IPage {
    name: string;
    title: string;
    description: string;
    keywords?: string;
    url: string;
    type: "website"
        | "article"
        | "book"
        | "profile"
        | "music.song"
        | "music.album"
        | "music.playlist"
        | "music.radio_station"
        | "video.movie"
        | "video.episode"
        | "video.tv_show"
        | "video.other";
}

interface IPages {
    [page: string]: IPage;
}